
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КоличествоТоваров Расход
	Движения.КоличествоТоваров.Записывать = Истина;
    Для Каждого ТекСтрокаПереченьТоваров Из ПереченьТоваров Цикл
      Движение = Движения.КоличествоТоваров.Добавить();
      Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
      Движение.Период = Дата;
      Движение.Товар = ТекСтрокаПереченьТоваров.Товар;
      Движение.Филиал = Филиал;
      Движение.Количество = ТекСтрокаПереченьТоваров.Количество;
    КонецЦикла;
    // регистр ПродажиПоФилиалам
    Движения.ПродажиПоФилиалам.Записывать = Истина;
    Для Каждого ТекСтрокаПереченьТоваров Из ПереченьТоваров Цикл
      Движение = Движения.ПродажиПоФилиалам.Добавить();
      Движение.Период = Дата;
      Движение.Филиал = Филиал;
      Движение.Менеджер = Менеджер;
      Движение.Сумма = ТекСтрокаПереченьТоваров.Сумма;
    КонецЦикла;
	// регистр РасчетыСФирмами Приход
	Движения.РасчетыСФирмами.Записывать = Истина;
	Движение = Движения.РасчетыСФирмами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Фирма = Фирма;
	Движение.Сумма = СуммаПоДокументу;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		Менеджер = ДанныеЗаполнения.Менеджер;
		Филиал = ДанныеЗаполнения.Филиал;
		Фирма = ДанныеЗаполнения.Фирма;
		Для Каждого ТекСтрокаПереченьТоваров Из ДанныеЗаполнения.ПереченьТоваров Цикл
			НоваяСтрока = ПереченьТоваров.Добавить();
			НоваяСтрока.Количество = ТекСтрокаПереченьТоваров.Количество;
			НоваяСтрока.Сумма = ТекСтрокаПереченьТоваров.Сумма;
			НоваяСтрока.Товар = ТекСтрокаПереченьТоваров.Товар;
			НоваяСтрока.Цена = ТекСтрокаПереченьТоваров.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	СуммаТЧ=0;
    Для Каждого СтрТабЧасти Из ПереченьТоваров Цикл
      СуммаТЧ= СуммаТЧ+ СтрТабЧасти.Сумма;
    КонецЦикла;
     СуммаПоДокументу= СуммаТЧ;
КонецПроцедуры
