
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КоличествоТоваров Приход
	Движения.КоличествоТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьТоваров Из ПереченьТоваров Цикл
		Движение = Движения.КоличествоТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаПереченьТоваров.Товар;
		Движение.Филиал = Филиал;
		Движение.Количество = ТекСтрокаПереченьТоваров.Количество;
	КонецЦикла;

	// регистр РасчетыСФирмами Расход
	Движения.РасчетыСФирмами.Записывать = Истина;
	Движение = Движения.РасчетыСФирмами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Фирма = Фирма;
	Движение.Сумма = СуммаПоДокументу;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
